import re
import sys

# Se deja un diccionario de todos los caractéres a convertir y sus equivalencias
unicode_map = {
    # Bold Serif
    '𝐀': 'A', '𝐁': 'B', '𝐂': 'C', '𝐃': 'D', '𝐄': 'E', '𝐅': 'F', '𝐆': 'G', '𝐇': 'H', '𝐈': 'I', '𝐉': 'J',
    '𝐊': 'K', '𝐋': 'L', '𝐌': 'M', '𝐍': 'N', '𝐎': 'O', '𝐏': 'P', '𝐐': 'Q', '𝐑': 'R', '𝐒': 'S', '𝐓': 'T',
    '𝐔': 'U', '𝐕': 'V', '𝐖': 'W', '𝐗': 'X', '𝐘': 'Y', '𝐙': 'Z', '𝐚': 'a', '𝐛': 'b', '𝐜': 'c', '𝐝': 'd',
    '𝐞': 'e', '𝐟': 'f', '𝐠': 'g', '𝐡': 'h', '𝐢': 'i', '𝐣': 'j', '𝐤': 'k', '𝐥': 'l', '𝐦': 'm', '𝐧': 'n',
    '𝐨': 'o', '𝐩': 'p', '𝐪': 'q', '𝐫': 'r', '𝐬': 's', '𝐭': 't', '𝐮': 'u', '𝐯': 'v', '𝐰': 'w', '𝐱': 'x',
    '𝐲': 'y', '𝐳': 'z', '𝟎': '0', '𝟏': '1', '𝟐': '2', '𝟑': '3', '𝟒': '4', '𝟓': '5', '𝟔': '6', '𝟕': '7',
    '𝟖': '8', '𝟗': '9', '𝐧̃': 'ñ', '𝐧́': 'ñ', '𝐍̃': 'Ñ', '𝐍́': 'Ñ', '𝐚́': 'á', '𝐞́': 'é', '𝐢́': 'í',
    '𝐨́': 'ó', '𝐮́': 'ú', '𝐀́': 'Á', '𝐄́': 'É', '𝐈́': 'Í', '𝐎́': 'Ó', '𝐔́': 'Ú',

    # Bold Sans Serif
    '𝗔': 'A', '𝗕': 'B', '𝗖': 'C', '𝗗': 'D', '𝗘': 'E', '𝗙': 'F', '𝗚': 'G', '𝗛': 'H', '𝗜': 'I', '𝗝': 'J',
    '𝗞': 'K', '𝗟': 'L', '𝗠': 'M', '𝗡': 'N', '𝗢': 'O', '𝗣': 'P', '𝗤': 'Q', '𝗥': 'R', '𝗦': 'S', '𝗧': 'T',
    '𝗨': 'U', '𝗩': 'V', '𝗪': 'W', '𝗫': 'X', '𝗬': 'Y', '𝗭': 'Z', '𝗮': 'a', '𝗯': 'b', '𝗰': 'c', '𝗱': 'd',
    '𝗲': 'e', '𝗳': 'f', '𝗴': 'g', '𝗵': 'h', '𝗶': 'i', '𝗷': 'j', '𝗸': 'k', '𝗹': 'l', '𝗺': 'm', '𝗻': 'n',
    '𝗼': 'o', '𝗽': 'p', '𝗾': 'q', '𝗿': 'r', '𝘀': 's', '𝘁': 't', '𝘂': 'u', '𝘃': 'v', '𝘄': 'w', '𝘅': 'x',
        '𝘆': 'y', '𝘇': 'z', '𝟬': '0', '𝟭': '1', '𝟮': '2', '𝟯': '3', '𝟰': '4', '𝟱': '5', '𝟲': '6', '𝟳': '7',
    '𝟴': '8', '𝟵': '9', '𝗻̃': 'ñ', '𝗻́': 'ñ', '𝗡̃': 'Ñ', '𝗡́': 'Ñ',

    # Italic Serif
    '𝐴': 'A', '𝐵': 'B', '𝐶': 'C', '𝐷': 'D', '𝐸': 'E', '𝐹': 'F', '𝐺': 'G', '𝐻': 'H', '𝐼': 'I', '𝐽': 'J',
    '𝐾': 'K', '𝐿': 'L', '𝑀': 'M', '𝑁': 'N', '𝑂': 'O', '𝑃': 'P', '𝑄': 'Q', '𝑅': 'R', '𝑆': 'S', '𝑇': 'T',
    '𝑈': 'U', '𝑉': 'V', '𝑊': 'W', '𝑋': 'X', '𝑌': 'Y', '𝑍': 'Z', '𝑎': 'a', '𝑏': 'b', '𝑐': 'c', '𝑑': 'd',
    '𝑒': 'e', '𝑓': 'f', '𝑔': 'g', '𝑖': 'i', '𝑗': 'j', '𝑘': 'k', '𝑙': 'l', '𝑚': 'm', '𝑛': 'n', '𝑜': 'o',
    '𝑝': 'p', '𝑞': 'q', '𝑟': 'r', '𝑠': 's', '𝑡': 't', '𝑢': 'u', '𝑣': 'v', '𝑤': 'w', '𝑥': 'x', '𝑦': 'y',
    '𝑧': 'z',

    # Italic Sans Serif
    '𝘈': 'A', '𝘉': 'B', '𝘊': 'C', '𝘋': 'D', '𝘌': 'E', '𝘍': 'F', '𝘎': 'G', '𝘏': 'H', '𝘐': 'I', '𝘑': 'J',
    '𝘒': 'K', '𝘓': 'L', '𝘔': 'M', '𝘕': 'N', '𝘖': 'O', '𝘗': 'P', '𝘘': 'Q', '𝘙': 'R', '𝘚': 'S', '𝘛': 'T',
    '𝘜': 'U', '𝘝': 'V', '𝘞': 'W', '𝘟': 'X', '𝘠': 'Y', '𝘡': 'Z', '𝘢': 'a', '𝘣': 'b', '𝘤': 'c', '𝘥': 'd',
    '𝘦': 'e', '𝘧': 'f', '𝘨': 'g', '𝘩': 'h', '𝘪': 'i', '𝘫': 'j', '𝘬': 'k', '𝘭': 'l', '𝘮': 'm', '𝘯': 'n',
    '𝘰': 'o', '𝘱': 'p', '𝘲': 'q', '𝘳': 'r', '𝘴': 's', '𝘵': 't', '𝘶': 'u', '𝘷': 'v', '𝘸': 'w', '𝘹': 'x',
    '𝘺': 'y', '𝘻': 'z',

    # Bold Italic Serif
    '𝑨': 'A', '𝑩': 'B', '𝑪': 'C', '𝑫': 'D', '𝑬': 'E', '𝑭': 'F', '𝑮': 'G', '𝑯': 'H', '𝑰': 'I', '𝑱': 'J',
    '𝑲': 'K', '𝑳': 'L', '𝑴': 'M', '𝑵': 'N', '𝑶': 'O', '𝑷': 'P', '𝑸': 'Q', '𝑹': 'R', '𝑺': 'S', '𝑻': 'T',
    '𝑼': 'U', '𝑽': 'V', '𝑾': 'W', '𝑿': 'X', '𝒀': 'Y', '𝒁': 'Z', '𝒂': 'a', '𝒃': 'b', '𝒄': 'c', '𝒅': 'd',
    '𝒆': 'e', '𝒇': 'f', '𝒈': 'g', '𝒉': 'h', '𝒊': 'i', '𝒋': 'j', '𝒌': 'k', '𝒍': 'l', '𝒎': 'm', '𝒏': 'n',
    '𝒐': 'o', '𝒑': 'p', '𝒒': 'q', '𝒓': 'r', '𝒔': 's',     '𝒕': 't', '𝒖': 'u', '𝒗': 'v', '𝒘': 'w', '𝒙': 'x', '𝒚': 'y', '𝒛': 'z',

    # Bold Italic Sans Serif
    '𝘈': 'A', '𝘉': 'B', '𝘊': 'C', '𝘋': 'D', '𝘌': 'E', '𝘍': 'F', '𝘎': 'G', '𝘏': 'H', '𝘐': 'I', '𝘑': 'J',
    '𝘒': 'K', '𝘓': 'L', '𝘔': 'M', '𝘕': 'N', '𝘖': 'O', '𝘗': 'P', '𝘘': 'Q', '𝘙': 'R', '𝘚': 'S', '𝘛': 'T',
    '𝘜': 'U', '𝘝': 'V', '𝘞': 'W', '𝘟': 'X', '𝘠': 'Y', '𝘡': 'Z', '𝘢': 'a', '𝘣': 'b', '𝘤': 'c', '𝘥': 'd',
    '𝘦': 'e', '𝘧': 'f', '𝘨': 'g', '𝘩': 'h', '𝘪': 'i', '𝘫': 'j', '𝘬': 'k', '𝘭': 'l', '𝘮': 'm', '𝘯': 'n',
    '𝘰': 'o', '𝘱': 'p', '𝘲': 'q', '𝘳': 'r', '𝘴': 's', '𝘵': 't', '𝘶': 'u', '𝘷': 'v', '𝘸': 'w', '𝘹': 'x',
    '𝘺': 'y', '𝘻': 'z', '𝙣̃': 'ñ', '𝙣́': 'ñ', '𝙉̃': 'Ñ', '𝙉́': 'Ñ',

    # Monospace
    '𝙰': 'A', '𝙱': 'B', '𝙲': 'C', '𝙳': 'D', '𝙴': 'E', '𝙵': 'F', '𝙶': 'G', '𝙷': 'H', '𝙸': 'I', '𝙹': 'J',
    '𝙺': 'K', '𝙻': 'L', '𝙼': 'M', '𝙽': 'N', '𝙾': 'O', '𝙿': 'P', '𝚀': 'Q', '𝚁': 'R', '𝚂': 'S', '𝚃': 'T',
    '𝚄': 'U', '𝚅': 'V', '𝚆': 'W', '𝚇': 'X', '𝚈': 'Y', '𝚉': 'Z', '𝚊': 'a', '𝚋': 'b', '𝚌': 'c', '𝚍': 'd',
    '𝚎': 'e', '𝚏': 'f', '𝚐': 'g', '𝚑': 'h', '𝚒': 'i', '𝚓': 'j', '𝚔': 'k', '𝚕': 'l', '𝚖': 'm', '𝚗': 'n',
    '𝚘': 'o', '𝚙': 'p', '𝚚': 'q', '𝚛': 'r', '𝚜': 's', '𝚝': 't', '𝚞': 'u', '𝚟': 'v', '𝚠': 'w', '𝚡': 'x',
    '𝚢': 'y', '𝚣': 'z', '𝟶': '0', '𝟷': '1', '𝟸': '2', '𝟹': '3', '𝟺': '4', '𝟻': '5', '𝟼': '6', '𝟽': '7',
    '𝟾': '8', '𝟿': '9', '𝙣̃': 'ñ', '𝙣́': 'ñ', '𝙉̃': 'Ñ', '𝙉́': 'Ñ',

    # Strikethrough
    'ñ̶': 'ñ', 'ń̶': 'ñ', 'Ñ̶': 'Ñ', 'Ń̶': 'Ñ',

    # Vowels with accents
    '𝐚́': 'á', '𝐞́': 'é', '𝐢́': 'í', '𝐨́': 'ó', '𝐮́': 'ú', '𝐀́': 'Á', '𝐄́': 'É', '𝐈́': 'Í', '𝐎́': 'Ó', '𝐔́': 'Ú',
    '𝗮́': 'á', '𝗲́': 'é', '𝗶́': 'í', '𝗼́': 'ó', '𝗳́': 'ú', '𝗔́': 'Á', '𝗘́': 'É', '𝗜́': 'Í', '𝗢́': 'Ó', '𝗨́': 'Ú',
    '𝑎́': 'á', '𝑒́': 'é', '𝑖́': 'í', '𝑜́': 'ó', '𝑢́': 'ú', '𝐴́': 'Á', '𝐸́': 'É', '𝐼́': 'Í', '𝑂́': 'Ó', '𝑈́': 'Ú',
    '𝘢́': 'á', '𝘦́': 'é', '𝘪́': 'í', '𝘰́': 'ó', '𝘶́': 'ú', '𝘈́': 'Á', '𝘌́': 'É', '𝘐́': 'Í', '𝘖́': 'Ó', '𝘜́': 'Ú',
    '𝒂́': 'á', '𝒆́': 'é', '𝒊́': 'í', '𝒐́': 'ó', '𝒖́': 'ú', '𝑨́': 'Á', '𝑬́': 'É', '𝑰́': 'Í', '𝑶́': 'Ó', '𝑼́': 'Ú',
    '𝙖́': 'á', '𝙚́': 'é', '𝙞́': 'í', '𝙤́': 'ó', '𝙪́': 'ú', '𝘼́': 'Á', '𝙀́': 'É', '𝙄́': 'Í', '𝙊́': 'Ó', '𝙐́': 'Ú',
    '𝚊́': 'á', '𝚎́': 'é', '𝚒́': 'í', '𝚘́': 'ó', '𝚞́': 'ú', '𝙰́': 'Á', '𝙴́': 'É', '𝙸́': 'Í', '𝙾́': 'Ó', '𝚄́': 'Ú',
    'á̶': 'á', 'é̶': 'é', 'í̶': 'í', 'ó̶': 'ó', 'ú̶': 'ú', 'Á̶': 'Á', 'É̶': 'É', 'Í̶': 'Í', 'Ó̶': 'Ó', 'Ú̶': 'Ú'
}

def transform(text):
    pattern = '|'.join(re.escape(key) for key in sorted(unicode_map.keys(), key=len, reverse=True))
    return re.sub(pattern, lambda m: unicode_map[m.group()], text)

def main():
    """Args:
        input_file: Nombre del archivo de chat de WhatsApp (formato txt, UTF-8). File Name from WhatsApp in txt
    """
    
    if len(sys.argv) != 2:
        print("Uso / Usage: python letters.py <input_file>")
        return
    
    input_file = sys.argv[1]

    try:
        with open(input_file, 'r', encoding='utf-8-sig') as file:
            original_text = file.read()
    except FileNotFoundError:
        print(f"Error: File '{input_file}' not found.")
        return
    except Exception as e:
        print("Error:", e)
        return

    transformed_text = transform(original_text)

    output_file = "new_" + input_file
    try:
        with open(output_file, 'w', encoding='utf-8-sig') as file:
            file.write(transformed_text)
    except Exception as e:
        print("Error:", e)
        return

    print(f"Transformación completa. Revisa el resultado en '{output_file}'. Transformation completed. Please, check '{output_file}'")

if __name__ == "__main__":
    main()
